# 2'. Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# *Пример:*

# - [2, 3, 4, 5, 6] =>[12,15,16]      ([2*6, 3*5, 4*4]);
# - [2, 3, 5, 6] => [12,15]   ( [2*6, 3*5]) 

list = [2, 3, 4, 5, 6, 7, 8]
temp = []
b = None
if (len(list)) % 2 != 0:
    b = int(((len(list)) / 2)+1)
else:
    b = int(((len(list)) / 2))

for i in range(0, b):
    x = list[i] * (list[-i-1])
    temp.append(x)
print(temp)

